src_ext/InformationRegisters/УЗ_НастройкиКаналов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_НастройкиКаналов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ПровайдерыСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяБота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СмещениеОбновлений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_КлючиКаналов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_КлючиКаналов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ПривязкиКаналов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ПривязкиКаналов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПривязки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПривязки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяВМессенджере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ЖурналРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЖурналРассылки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Адреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_СтатусыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ШаблоныСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсталосьЗанятий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткийТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_КаналыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_КаналыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телеграм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WhatsApp</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Enums/УЗ_СтатусыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_СтатусыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Песочница</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Задолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеАбонемента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/CommonModules/УЗ_Сообщения/Ext/Module.bsl
//Сообщения ученикам и плательщикам по каналам: электронная почта (УЗ_Почта), Telegram, SMS, WhatsApp
//(УЗ_ПровайдерыСообщений). Общая основа для напоминаний, рассылки должникам и ручной отправки — и для бота Telegram
//следующего этапа (привязка чата по ссылке с кодом, отписка /stop, приём сообщений боту).
//  Кому: ученик и его плательщики (табличная часть «Плательщики»), у кого отмечено «Согласие на сообщения»
//  (реквизит ОповеститьПоEmail — прежнее «Оповестить по email», В45). Каналом, выбранным в карточке («Канал
//  сообщений»; пусто — почта); канал не настроен или нет адреса (не привязан Telegram, нет телефона) — почтой, если
//  есть e-mail; иначе не пишем, причина — в предпросмотре.
//  Цикл отправки: первый отказ сервиса (нет связи, неверный ключ, нет денег) — остальным этим каналом в этом цикле
//  не шлём (они получат сообщение в следующем цикле); отказ получателя (нет номера) другим не мешает.
//  Журнал — регистр УЗ_ЖурналРассылки: каждая попытка с каналом, статусом и ошибкой; по нему напоминание не
//  повторяется, а неудачное повторяется не больше МаксимумПопыток раз.
//  Песочница сеанса (тесты на копиях баз) — УЗ_Почта.ПесочницаВключена: письма и HTTP-запросы наружу не уходят.

#Область ПрограммныйИнтерфейс

//Сколько раз повторять неудачное напоминание (о занятии, об окончании абонемента) одному получателю.
Функция МаксимумПопыток() Экспорт
	Возврат 3;
КонецФункции

//Каналы по порядку для форм.
Функция Каналы() Экспорт

	Итог = Новый Массив;
	Итог.Добавить(Перечисления.УЗ_КаналыСообщений.Почта);
	Итог.Добавить(Перечисления.УЗ_КаналыСообщений.Телеграм);
	Итог.Добавить(Перечисления.УЗ_КаналыСообщений.SMS);
	Итог.Добавить(Перечисления.УЗ_КаналыСообщений.WhatsApp);
	Возврат Итог;

КонецФункции

//Почему канал сейчас не отправит ("" — готов). Почта — настройки почты; остальные — настройки каналов, ключ и
//безопасный режим (HTTP в нём запрещён; в песочнице тестов запрос наружу не уходит, поэтому ей он не помеха).
Функция ПричинаНеготовностиКанала(Канал) Экспорт

	Если Канал = Перечисления.УЗ_КаналыСообщений.Почта Тогда
		Причина = "";
		УЗ_Почта.ПочтаНастроена(Причина);
		Если ПустаяСтрока(Причина) И УЗ_Общий.БезопасныйРежимДействует() И Не УЗ_Почта.ПесочницаВключена() Тогда
			Причина = ТекстБезопасногоРежима();
		КонецЕсли;
		Возврат Причина;
	КонецЕсли;
	Настройки = НастройкиКанала(Канал);
	Если Не Настройки.Включен Тогда
		Возврат СтрШаблон(НСтр("ru = 'Канал «%1» выключен в настройках сообщений.'"), Канал);
	ИначеЕсли Не ЗначениеЗаполнено(Настройки.Провайдер) Тогда
		Возврат СтрШаблон(НСтр("ru = 'У канала «%1» не выбран провайдер.'"), Канал);
	ИначеЕсли Не Настройки.КлючЗадан Тогда
		Возврат СтрШаблон(НСтр("ru = 'У канала «%1» не задан ключ доступа.'"), Канал);
	ИначеЕсли УЗ_ПровайдерыСообщений.НуженЛогин(Настройки.Провайдер) И ПустаяСтрока(Настройки.Логин) Тогда
		Возврат СтрШаблон(НСтр("ru = 'У канала «%1» не указан логин (номер аккаунта) провайдера.'"), Канал);
	ИначеЕсли УЗ_Общий.БезопасныйРежимДействует() И Не УЗ_Почта.ПесочницаВключена() Тогда
		Возврат ТекстБезопасногоРежима();
	КонецЕсли;
	Возврат "";

КонецФункции

//«Отправка сообщений в безопасном режиме запрещена» и как его снять — одинаково во всех формах и журналах.
Функция ТекстБезопасногоРежима() Экспорт
	Возврат НСтр("ru = 'Отправка сообщений (почта, Telegram, SMS, WhatsApp) в безопасном режиме запрещена.'") + " "
		+ УЗ_Общий.КакСнятьБезопасныйРежим();
КонецФункции

//Настройки канала Telegram, SMS или WhatsApp без ключа: Включен, Провайдер, АдресСервиса, Логин, Отправитель,
//ИмяБота, СмещениеОбновлений, КлючЗадан.
Функция НастройкиКанала(Канал) Экспорт

	Итог = Новый Структура("Канал, Включен, Провайдер, АдресСервиса, Логин, Отправитель, ИмяБота, СмещениеОбновлений,
		|КлючЗадан", Канал, Ложь, Перечисления.УЗ_ПровайдерыСообщений.ПустаяСсылка(), "", "", "", "", 0, Ложь);
	Если Канал = Перечисления.УЗ_КаналыСообщений.Почта Тогда
		Итог.Включен = УЗ_Почта.Настройки().Включена;
		Итог.КлючЗадан = УЗ_Почта.Настройки().ПарольЗадан;
		Возврат Итог;
	КонецЕсли;
	Запись = РегистрыСведений.УЗ_НастройкиКаналов.СоздатьМенеджерЗаписи();
	Запись.Канал = Канал;
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Запись.Прочитать();
		Ключ = РегистрыСведений.УЗ_КлючиКаналов.СоздатьМенеджерЗаписи();
		Ключ.Канал = Канал;
		Ключ.Прочитать();
		Итог.КлючЗадан = Ключ.Выбран() И Не ПустаяСтрока(Ключ.Ключ);
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		//безопасный режим: привилегированный режим не действует — отправки
		//всё равно не будет (см. ТекстБезопасногоРежима)
		УстановитьПривилегированныйРежим(Ложь);
		ЗаписьЖурналаРегистрации(УЗ_ПровайдерыСообщений.СобытиеОшибки(), УровеньЖурналаРегистрации.Предупреждение, , ,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Итог;
	КонецПопытки;
	Если Запись.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(Итог, Запись, "Включен, Провайдер, АдресСервиса, Логин, Отправитель, ИмяБота,
			|СмещениеОбновлений");
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Право менять настройки каналов и шаблоны: руководитель (как настройки учёта).
Функция ЕстьПравоНастройки() Экспорт
	Возврат ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УЗ_НастройкиКаналов);
КонецФункции

//Записать настройки канала. Ключ меняется, только если ИзменитьКлюч (в форму ключ не передаётся, поле пустое).
Процедура СохранитьНастройкиКанала(Канал, Данные, НовыйКлюч = "", ИзменитьКлюч = Ложь) Экспорт

	Если Не ЕстьПравоНастройки() Тогда
		ВызватьИсключение НСтр("ru = 'Настройки каналов сообщений может менять только руководитель.'");
	КонецЕсли;
	Запись = РегистрыСведений.УЗ_НастройкиКаналов.СоздатьМенеджерЗаписи();
	Запись.Канал = Канал;
	Запись.Прочитать();
	Запись.Канал = Канал;
	ЗаполнитьЗначенияСвойств(Запись, Данные, "Включен, Провайдер, АдресСервиса, Логин, Отправитель, ИмяБота");
	Запись.Записать();
	Если ИзменитьКлюч Тогда
		УстановитьПривилегированныйРежим(Истина);
		Ключ = РегистрыСведений.УЗ_КлючиКаналов.СоздатьМенеджерЗаписи();
		Ключ.Канал = Канал;
		Ключ.Ключ = СокрЛП(НовыйКлюч);
		Ключ.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

#Область Получатели

//Кому пишем по ученику: он сам и его плательщики (без повторов).
//Массив структур: ФизЛицо, Имя, КемПриходится, Канал, Адрес, Представление, МожноПисать, Причина.
//  Канал — выбранный в карточке, если он готов и у человека есть адрес для него; иначе почта (если есть e-mail).
//  Готовность — Соответствие Канал → причина неготовности (кэш цикла, см. НовыйЦикл); не задана — считается здесь.
Функция Получатели(Ученик, Готовность = Неопределено) Экспорт

	Если Готовность = Неопределено Тогда
		Готовность = ГотовностьКаналов();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	0 КАК Порядок,
	|	0 КАК НомерСтроки,
	|	ФизЛица.Ссылка КАК ФизЛицо,
	|	"""" КАК КемПриходится
	|ПОМЕСТИТЬ ВТ_Люди
	|ИЗ
	|	Справочник.УЗ_ФизЛица КАК ФизЛица
	|ГДЕ
	|	ФизЛица.Ссылка = &Ученик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Плательщики.Основной
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	Плательщики.НомерСтроки,
	|	Плательщики.Плательщик,
	|	Плательщики.КемПриходится
	|ИЗ
	|	Справочник.УЗ_ФизЛица.Плательщики КАК Плательщики
	|ГДЕ
	|	Плательщики.Ссылка = &Ученик
	|	И Плательщики.Плательщик <> &Ученик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Люди.ФизЛицо КАК ФизЛицо,
	|	Люди.ФизЛицо.Наименование КАК Имя,
	|	Люди.КемПриходится КАК КемПриходится,
	|	Люди.ФизЛицо.EMail КАК EMail,
	|	Люди.ФизЛицо.Телефон КАК Телефон,
	|	Люди.ФизЛицо.ОповеститьПоEmail КАК Согласие,
	|	Люди.ФизЛицо.ПредпочитаемыйКанал КАК Канал,
	|	ЕСТЬNULL(Привязки.Адрес, """") КАК Чат
	|ИЗ
	|	ВТ_Люди КАК Люди
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УЗ_ПривязкиКаналов КАК Привязки
	|		ПО Люди.ФизЛицо = Привязки.ФизЛицо
	|			И (Привязки.Канал = ЗНАЧЕНИЕ(Перечисление.УЗ_КаналыСообщений.Телеграм))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Люди.Порядок,
	|	Люди.НомерСтроки";
	Запрос.УстановитьПараметр("Ученик", Ученик);
	Выборка = Запрос.Выполнить().Выбрать();
	Итог = Новый Массив;
	Были = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Если Были[Выборка.ФизЛицо] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Были.Вставить(Выборка.ФизЛицо, Истина);
		Получатель = Новый Структура("ФизЛицо, Имя, КемПриходится, Канал, Адрес, Представление, МожноПисать, Причина",
			Выборка.ФизЛицо, Выборка.Имя, Выборка.КемПриходится, Перечисления.УЗ_КаналыСообщений.ПустаяСсылка(), "", "",
				Ложь,
			"");
		ВыбратьКанал(Получатель, Выборка, Готовность);
		Итог.Добавить(Получатель);
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Телефон для SMS и WhatsApp: 11 цифр с 7 впереди (+7 900 000-00-01, 8 (900) 000-00-01, 9000000001 → 79000000001);
//"" — номер не российский мобильный или неполный.
Функция НормализоватьТелефон(Телефон) Экспорт

	Цифры = "";
	Для Поз = 1 По СтрДлина(Телефон) Цикл
		Знак = Сред(Телефон, Поз, 1);
		Если СтрНайти("0123456789", Знак) > 0 Тогда
			Цифры = Цифры + Знак;
		КонецЕсли;
	КонецЦикла;
	Если СтрДлина(Цифры) = 10 И Лев(Цифры, 1) = "9" Тогда
		Цифры = "7" + Цифры;
	ИначеЕсли СтрДлина(Цифры) = 11 И Лев(Цифры, 1) = "8" Тогда
		Цифры = "7" + Сред(Цифры, 2);
	КонецЕсли;
	Если СтрДлина(Цифры) <> 11 Или Лев(Цифры, 2) <> "79" Тогда
		Возврат "";
	КонецЕсли;
	Возврат Цифры;

КонецФункции

#КонецОбласти

#Область Отправка

//Цикл отправки: готовность каналов (раз за цикл) и сервисы, которые уже отказали в этом цикле.
//Структура: Готовность (Соответствие Канал → причина), Недоступны (Соответствие Канал → ошибка сервиса).
Функция НовыйЦикл() Экспорт
	Возврат Новый Структура("Готовность, Недоступны", ГотовностьКаналов(), Новый Соответствие);
КонецФункции

//Отправить сообщение одному получателю (структура из Получатели) и записать попытку в журнал.
//  Сообщение — Структура: Вид, Ученик, Организация, Сумма, Источник, Тема, Текст (письмо), КраткийТекст (SMS,
//  мессенджеры; пусто — Текст), Вручную.
//Структура: Статус (УЗ_СтатусыСообщений), Отправлено, ТекстОшибки.
Функция ОтправитьПолучателю(ЦиклОтправки, Получатель, Сообщение) Экспорт

	Итог = Новый Структура("Статус, Отправлено, ТекстОшибки", Перечисления.УЗ_СтатусыСообщений.Ошибка, Ложь, "");
	Канал = Получатель.Канал;
	Текст = ?(Канал = Перечисления.УЗ_КаналыСообщений.Почта Или ПустаяСтрока(Сообщение.КраткийТекст), Сообщение.Текст,
		Сообщение.КраткийТекст);
	Если Не Получатель.МожноПисать Тогда
		Итог.ТекстОшибки = Получатель.Причина;
		Возврат Итог;
	КонецЕсли;
	ОшибкаСервиса = ЦиклОтправки.Недоступны.Получить(Канал);
	Если ОшибкаСервиса <> Неопределено Тогда
		Итог.ТекстОшибки = НСтр("ru = 'не отправляли: сервис недоступен в этом цикле —'") + " " + ОшибкаСервиса;
	ИначеЕсли Канал = Перечисления.УЗ_КаналыСообщений.Почта Тогда
		ТекстОшибки = "";
		Итог.Отправлено = УЗ_Почта.Отправить(Получатель.Адрес, Сообщение.Тема, Текст, ТекстОшибки);
		Итог.ТекстОшибки = ТекстОшибки;
		Итог.Статус = ?(Итог.Отправлено, ?(УЗ_Почта.ПесочницаВключена(), Перечисления.УЗ_СтатусыСообщений.Песочница,
			Перечисления.УЗ_СтатусыСообщений.Отправлено), Перечисления.УЗ_СтатусыСообщений.Ошибка);
		Если Не Итог.Отправлено Тогда
			//SMTP не ответил или не пустил: остальные письма этого цикла ждали бы тот же таймаут
			ЦиклОтправки.Недоступны.Вставить(Канал, ТекстОшибки);
		КонецЕсли;
	Иначе
		Если Канал = Перечисления.УЗ_КаналыСообщений.Телеграм Тогда
			Текст = Текст + Символы.ПС + Символы.ПС + ПодписьОтпискиТелеграм();
		КонецЕсли;
		Ответ = УЗ_ПровайдерыСообщений.Отправить(Канал, Получатель.Адрес, Текст);
		Итог.Отправлено = Ответ.Отправлено;
		Итог.ТекстОшибки = Ответ.ТекстОшибки;
		Итог.Статус = ?(Ответ.Песочница, Перечисления.УЗ_СтатусыСообщений.Песочница,
			?(Ответ.Отправлено, Перечисления.УЗ_СтатусыСообщений.Отправлено, Перечисления.УЗ_СтатусыСообщений.Ошибка));
		Если Ответ.СервисНедоступен Тогда
			ЦиклОтправки.Недоступны.Вставить(Канал, Ответ.ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	Запись = НоваяЗаписьЖурнала(Сообщение, Получатель.ФизЛицо, Канал, Получатель.Адрес);
	Запись.Отправлено = Итог.Отправлено;
	Запись.Статус = Итог.Статус;
	Запись.ТекстОшибки = Итог.ТекстОшибки;
	Запись.Текст = Текст;
	РегистрыСведений.УЗ_ЖурналРассылки.ЗаписатьСообщение(Запись);
	Возврат Итог;

КонецФункции

//Сообщение всем получателям ученика с согласием. Письма (почта) — одним письмом на все адреса, как прежде
//письма о задолженности; остальные — каждому своим каналом.
//Структура: Отправлено (хоть одному), ОтправленоВсем, Адреса (Массив строк — кому ушло), ТекстОшибки (первая
//ошибка), Итоги (Массив структур Получатель, Канал, Отправлено, ТекстОшибки), Получателей.
Функция ОтправитьУченику(ЦиклОтправки, Ученик, Сообщение) Экспорт

	Итог = Новый Структура("Отправлено, ОтправленоВсем, Адреса, ТекстОшибки, Итоги, Получателей", Ложь, Истина,
		Новый Массив, "", Новый Массив, 0);
	Письмо = Неопределено;
	Для Каждого Получатель Из Получатели(Ученик, ЦиклОтправки.Готовность) Цикл
		Если Не Получатель.МожноПисать Тогда
			Продолжить;
		КонецЕсли;
		Итог.Получателей = Итог.Получателей + 1;
		Если Получатель.Канал = Перечисления.УЗ_КаналыСообщений.Почта Тогда
			Если Письмо = Неопределено Тогда
				Письмо = Новый Структура(
					"ФизЛицо, Имя, КемПриходится, Канал, Адрес, Представление, МожноПисать, Причина");
				ЗаполнитьЗначенияСвойств(Письмо, Получатель);
				Письмо.Адрес = Новый Массив;
				//письмо на несколько адресов семьи — в журнале без получателя (адреса — в колонке «Адреса»)
				Письмо.ФизЛицо = Справочники.УЗ_ФизЛица.ПустаяСсылка();
			КонецЕсли;
			Если Письмо.Адрес.Найти(Получатель.Адрес) = Неопределено Тогда
				Письмо.Адрес.Добавить(Получатель.Адрес);
			КонецЕсли;
			Если Письмо.Адрес.Количество() = 1 Тогда
				Письмо.ФизЛицо = Получатель.ФизЛицо;
			Иначе
				Письмо.ФизЛицо = Справочники.УЗ_ФизЛица.ПустаяСсылка();
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		ДобавитьИтог(Итог, Получатель, ОтправитьПолучателю(ЦиклОтправки, Получатель, Сообщение));
	КонецЦикла;
	Если Письмо <> Неопределено Тогда
		ДобавитьИтог(Итог, Письмо, ОтправитьПолучателю(ЦиклОтправки, Письмо, Сообщение));
	КонецЕсли;
	Если Итог.Получателей = 0 Тогда
		Итог.ОтправленоВсем = Ложь;
		Итог.ТекстОшибки = ТекстНекому();
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Готовность каналов на сейчас: Соответствие Канал → причина неготовности ("" — готов). ПочтаГотова — считать
//почту готовой (список рассылки должникам показывает адреса и тогда, когда почта ещё не настроена: причину
//неготовности форма пишет в «Состоянии», а отправка её проверяет).
Функция ГотовностьКаналов(ПочтаГотова = Ложь) Экспорт

	Итог = Новый Соответствие;
	Для Каждого Канал Из Каналы() Цикл
		Итог.Вставить(Канал, ?(ПочтаГотова И Канал = Перечисления.УЗ_КаналыСообщений.Почта, "",
			ПричинаНеготовностиКанала(Канал)));
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Почему писать некому — одинаково в рассылке, ручной отправке и справке.
Функция ТекстНекому() Экспорт
	Возврат НСтр("ru = 'нет e-mail, телефона или привязанного Telegram у тех, кто дал согласие на сообщения'");
КонецФункции

//Новое сообщение (для ОтправитьПолучателю и ОтправитьУченику).
Функция НовоеСообщение(Вид, Ученик, Тема = "", Текст = "", КраткийТекст = "") Экспорт

	Возврат Новый Структура("Вид, Ученик, Организация, Сумма, Источник, Тема, Текст, КраткийТекст, Вручную", Вид,
		Ученик, Справочники.Организации.ПустаяСсылка(), 0, Неопределено, Тема, Текст, КраткийТекст, Ложь);

КонецФункции

//Ручная отправка (обработка «Сообщение ученику»): ученику и его плательщикам с согласием, каждому своим каналом.
//Структура — см. ОтправитьУченику.
Функция ОтправитьВручную(Ученик, Тема, Текст, КраткийТекст = "") Экспорт

	Если Не ПравоДоступа("Использование", Метаданные.Обработки.УЗ_ОтправкаСообщения) Тогда
		ВызватьИсключение НСтр("ru = 'Нет права на отправку сообщений.'");
	КонецЕсли;
	Сообщение = НовоеСообщение(Перечисления.УЗ_ВидыСообщений.Вручную, Ученик, Тема, Текст, КраткийТекст);
	Сообщение.Вручную = Истина;
	Возврат ОтправитьУченику(НовыйЦикл(), Ученик, Сообщение);

КонецФункции

//Проверка канала из настроек: сообщение на указанный адрес (e-mail, телефон, номер чата Telegram).
//Структура: Отправлено, ТекстОшибки, Песочница.
Функция ПроверитьКанал(Канал, Адрес) Экспорт

	Итог = Новый Структура("Отправлено, ТекстОшибки, Песочница", Ложь, "", Ложь);
	Если Не ЕстьПравоНастройки() Тогда
		Итог.ТекстОшибки = НСтр("ru = 'Проверять каналы может только руководитель.'");
		Возврат Итог;
	КонецЕсли;
	Причина = ПричинаНеготовностиКанала(Канал);
	Если Не ПустаяСтрока(Причина) Тогда
		Итог.ТекстОшибки = Причина;
		Возврат Итог;
	КонецЕсли;
	Текст = НСтр("ru = 'Учёт занятий: проверка канала. Если вы читаете это сообщение, канал настроен верно.'");
	Если Канал = Перечисления.УЗ_КаналыСообщений.Почта Тогда
		ТекстОшибки = "";
		Итог.Отправлено = УЗ_Почта.Отправить(Адрес, НСтр("ru = 'Учёт занятий: проверка канала'"), Текст, ТекстОшибки);
		Итог.ТекстОшибки = ТекстОшибки;
		Итог.Песочница = УЗ_Почта.ПесочницаВключена();
		Возврат Итог;
	КонецЕсли;
	АдресКанала = СокрЛП(Адрес);
	Если Канал <> Перечисления.УЗ_КаналыСообщений.Телеграм Тогда
		АдресКанала = НормализоватьТелефон(Адрес);
		Если ПустаяСтрока(АдресКанала) Тогда
			Итог.ТекстОшибки = НСтр("ru = 'Укажите мобильный телефон, например +7 900 000-00-01.'");
			Возврат Итог;
		КонецЕсли;
	ИначеЕсли ПустаяСтрока(АдресКанала) Тогда
		Итог.ТекстОшибки =
			НСтр("ru = 'Укажите номер чата Telegram (его показывает карточка человека после привязки).'");
		Возврат Итог;
	КонецЕсли;
	Ответ = УЗ_ПровайдерыСообщений.Отправить(Канал, АдресКанала, Текст);
	ЗаполнитьЗначенияСвойств(Итог, Ответ, "Отправлено, ТекстОшибки, Песочница");
	Возврат Итог;

КонецФункции

#КонецОбласти

#Область Шаблоны

//Шаблон и настройка напоминания вида: Включено, ЗаЧасов, ОсталосьЗанятий, ЗаДней, Тема, Текст, КраткийТекст.
//Не заполнено — текст по умолчанию (ШаблонПоУмолчанию).
Функция Шаблон(Вид) Экспорт

	Итог = ШаблонПоУмолчанию(Вид);
	Запись = РегистрыСведений.УЗ_ШаблоныСообщений.СоздатьМенеджерЗаписи();
	Запись.Вид = Вид;
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.УЗ_ШаблоныСообщений) Тогда
		Запись.Прочитать();
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		Запись.Прочитать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	Если Не Запись.Выбран() Тогда
		Возврат Итог;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Итог, Запись, "Включено, ЗаЧасов, ОсталосьЗанятий, ЗаДней");
	Для Каждого Поле Из СтрРазделить("Тема,Текст,КраткийТекст", ",") Цикл
		Если Не ПустаяСтрока(Запись[Поле]) Тогда
			Итог[Поле] = Запись[Поле];
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Записать шаблон вида (руководитель). Данные — Структура полей Шаблон.
Процедура СохранитьШаблон(Вид, Данные) Экспорт

	Если Не ЕстьПравоНастройки() Тогда
		ВызватьИсключение НСтр("ru = 'Шаблоны сообщений может менять только руководитель.'");
	КонецЕсли;
	Запись = РегистрыСведений.УЗ_ШаблоныСообщений.СоздатьМенеджерЗаписи();
	Запись.Вид = Вид;
	ЗаполнитьЗначенияСвойств(Запись, Данные, "Включено, ЗаЧасов, ОсталосьЗанятий, ЗаДней, Тема, Текст, КраткийТекст");
	Запись.Записать();

КонецПроцедуры

//Текст по умолчанию: Структура Включено, ЗаЧасов, ОсталосьЗанятий, ЗаДней, Тема, Текст, КраткийТекст.
Функция ШаблонПоУмолчанию(Вид) Экспорт

	Итог = Новый Структура("Включено, ЗаЧасов, ОсталосьЗанятий, ЗаДней, Тема, Текст, КраткийТекст", Ложь, 0, 0, 0, "",
		"",
		"");
	Отписка = НСтр("ru = 'Если вы не хотите получать такие сообщения, ответьте на это письмо — мы перестанем писать.'");
	Если Вид = Перечисления.УЗ_ВидыСообщений.Занятие Тогда
		Итог.ЗаЧасов = 24;
		Итог.Тема = НСтр("ru = 'Напоминание о занятии [Дата] в [Время]'");
		Итог.Текст = НСтр("ru = 'Здравствуйте, [Получатель]!
			|
			|Напоминаем: [Дата] в [Время] — занятие «[Предмет]» у ученика [Ученик].
			|Педагог: [Педагог]. [Помещение]
			|
			|'") + Отписка;
		Итог.КраткийТекст = НСтр("ru = '[Ученик]: занятие «[Предмет]» [Дата] в [Время].'");
	ИначеЕсли Вид = Перечисления.УЗ_ВидыСообщений.ОкончаниеАбонемента Тогда
		Итог.ОсталосьЗанятий = 1;
		Итог.ЗаДней = 3;
		Итог.Тема = НСтр("ru = 'Абонемент заканчивается'");
		Итог.Текст = НСтр("ru = 'Здравствуйте, [Получатель]!
			|
			|Абонемент ученика [Ученик] «[Абонемент]» заканчивается:
			|осталось занятий — [ОсталосьЗанятий], действует до [ДействуетДо].
			|Продлить его можно при следующем посещении.
			|
			|'") + Отписка;
		Итог.КраткийТекст =
			НСтр("ru = '[Ученик]: абонемент «[Предмет]» заканчивается — осталось занятий [ОсталосьЗанятий], до "
			+ "[ДействуетДо].'");
	ИначеЕсли Вид = Перечисления.УЗ_ВидыСообщений.Задолженность Тогда
		Итог.Тема = НСтр("ru = 'Задолженность за занятия'");
		Итог.Текст = НСтр("ru = 'Здравствуйте!
			|
			|По занятиям ученика [Ученик] ([Предмет]) задолженность [Сумма] руб.
			|Организация: [Организация].
			|Пожалуйста, пополните баланс при следующем посещении.
			|
			|Если вы уже оплатили, просто не обращайте внимания на это письмо.'");
		Итог.КраткийТекст =
			НСтр("ru = '[Ученик]: задолженность за занятия [Сумма] руб. ([Организация]). Если уже оплатили — не "
			+ "обращайте внимания.'");
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Подстановки шаблона вида — для подсказки в настройках и справки.
Функция Подстановки(Вид) Экспорт

	Если Вид = Перечисления.УЗ_ВидыСообщений.Занятие Тогда
		Возврат "[Получатель], [Ученик], [Дата], [Время], [Предмет], [Педагог], [Группа], [Помещение], [Организация]";
	ИначеЕсли Вид = Перечисления.УЗ_ВидыСообщений.ОкончаниеАбонемента Тогда
		Возврат "[Получатель], [Ученик], [Абонемент], [Предмет], [ОсталосьЗанятий], [ДействуетДо], [Организация]";
	ИначеЕсли Вид = Перечисления.УЗ_ВидыСообщений.Задолженность Тогда
		Возврат "[Ученик], [Сумма], [Предмет], [Организация], [ДнейДолга]";
	КонецЕсли;
	Возврат "";

КонецФункции

//Подставить значения: [Имя] → Значения.Имя (строки, числа, даты — как есть в Значения).
Функция ПодставитьЗначения(Знач Текст, Значения) Экспорт

	Для Каждого Значение Из Значения Цикл
		Текст = СтрЗаменить(Текст, "[" + Значение.Ключ + "]", Строка(Значение.Значение));
	КонецЦикла;
	Возврат Текст;

КонецФункции

#КонецОбласти

#Область Задолженность

//Сообщение о задолженности ученику и плательщикам с согласием (регламентное оповещение о долге и рассылка
//должникам). Должник — Структура Ученик, Организация, Долг, Предметы, ДнейДолга.
//  Тема, Шаблон — письмо (из формы рассылки); пусто — из шаблона «Задолженность»; короткий текст для SMS и
//  мессенджеров — всегда из шаблона «Задолженность» настроек сообщений.
//Структура — см. ОтправитьУченику.
Функция ОтправитьОЗадолженности(ЦиклОтправки, Должник, Тема = "", ТекстПисьма = "", Вручную = Ложь) Экспорт

	Шаблон = Шаблон(Перечисления.УЗ_ВидыСообщений.Задолженность);
	Значения = Новый Структура("Ученик, Сумма, Предмет, Организация, ДнейДолга", Строка(Должник.Ученик),
		Формат(Должник.Долг, "ЧДЦ=2; ЧН=0"),
			?(ПустаяСтрока(Должник.Предметы), НСтр("ru = 'занятия'"), Должник.Предметы),
		Строка(Должник.Организация), Формат(Должник.ДнейДолга, "ЧГ=0; ЧН=0"));
	Сообщение = НовоеСообщение(Перечисления.УЗ_ВидыСообщений.Задолженность, Должник.Ученик,
		ПодставитьЗначения(?(ПустаяСтрока(Тема), Шаблон.Тема, Тема), Значения),
		ПодставитьЗначения(?(ПустаяСтрока(ТекстПисьма), Шаблон.Текст, ТекстПисьма), Значения),
		ПодставитьЗначения(Шаблон.КраткийТекст, Значения));
	Сообщение.Организация = Должник.Организация;
	Сообщение.Сумма = Должник.Долг;
	Сообщение.Вручную = Вручную;
	Возврат ОтправитьУченику(ЦиклОтправки, Должник.Ученик, Сообщение);

КонецФункции

//Включены ли автоматические сообщения о задолженности: флажок «Письма о задолженности» настроек почты (как в 2.0)
//или «Отправлять автоматически» у шаблона «Задолженность» настроек сообщений (Telegram, SMS, WhatsApp).
Функция АвтоматическиОЗадолженности() Экспорт

	Возврат УЗ_Почта.Настройки().ПисьмаОЗадолженности
		Или Шаблон(Перечисления.УЗ_ВидыСообщений.Задолженность).Включено;

КонецФункции

#КонецОбласти

#Область Напоминания

//Регламентное задание «Отправка напоминаний ученикам»: о занятиях и об окончании абонементов. В безопасном режиме —
//одно предупреждение в журнал регистрации (как его снять) и ничего не отправляется.
Процедура ОтправкаНапоминаний() Экспорт

	ПроверитьПравоЗапуска();
	Если УЗ_Общий.БезопасныйРежимДействует() И Не УЗ_Почта.ПесочницаВключена() Тогда
		ЗаписьЖурналаРегистрации(УЗ_ПровайдерыСообщений.СобытиеОшибки(), УровеньЖурналаРегистрации.Предупреждение, , ,
			ТекстБезопасногоРежима());
		Возврат;
	КонецЕсли;
	ЦиклОтправки = НовыйЦикл();
	НапоминанияОЗанятиях(Неопределено, ЦиклОтправки);
	НапоминанияОбАбонементах(Неопределено, ЦиклОтправки);

КонецПроцедуры

//Напоминания о занятиях, до начала которых осталось не больше «За сколько часов» (шаблон «Напоминание о занятии»):
//ученику и плательщикам, каждому один раз (по журналу); неудачное — повтор до МаксимумПопыток раз.
//  Ученики — массив (проверки на копиях: только свои ученики) или Неопределено — все.
//  Цикл — цикл отправки (сервисы, отказавшие в этом цикле); не задан — новый.
//Массив структур итогов: Источник, Ученик, Получатель, Канал, Статус, ТекстОшибки.
Функция НапоминанияОЗанятиях(Ученики = Неопределено, ЦиклОтправки = Неопределено) Экспорт

	ПроверитьПравоЗапуска();
	Итоги = Новый Массив;
	Шаблон = Шаблон(Перечисления.УЗ_ВидыСообщений.Занятие);
	Если Не Шаблон.Включено Или Шаблон.ЗаЧасов <= 0 Тогда
		Возврат Итоги;
	КонецЕсли;
	ЦиклОтправки = ?(ЦиклОтправки = Неопределено, НовыйЦикл(), ЦиклОтправки);
	Сейчас = ТекущаяДатаСеанса();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Строки.Ссылка КАК Урок,
	|	Строки.Ссылка.Дата КАК Дата,
	|	Строки.Ссылка.Организация КАК Организация,
	|	Строки.Ссылка.ПредметОбучения КАК Предмет,
	|	Строки.Ссылка.ГруппаОбучения КАК Группа,
	|	Строки.Ссылка.Педагог КАК Педагог,
	|	Строки.Ссылка.Помещение КАК Помещение,
	|	Строки.Ученик КАК Ученик
	|ИЗ
	|	Документ.УЗ_Урок.Ученики КАК Строки
	|ГДЕ
	|	Строки.Ссылка.Дата > &Сейчас
	|	И Строки.Ссылка.Дата <= &До
	|	И НЕ Строки.Ссылка.ПометкаУдаления
	|	И НЕ Строки.Ученик.Выбыл
	|	И (&ВсеУченики
	|			ИЛИ Строки.Ученик В (&Ученики))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("Сейчас", Сейчас);
	Запрос.УстановитьПараметр("До", Сейчас + Шаблон.ЗаЧасов * 3600);
	УстановитьОтборУчеников(Запрос, Ученики);
	Таблица = Запрос.Выполнить().Выгрузить();
	История = ИсторияНапоминаний(Перечисления.УЗ_ВидыСообщений.Занятие, Таблица.ВыгрузитьКолонку("Урок"));
	Для Каждого СтрокаУрока Из Таблица Цикл
		Значения = Новый Структура("Получатель, Ученик, Дата, Время, Предмет, Педагог, Группа, Помещение, Организация",
			"",
			Строка(СтрокаУрока.Ученик), Формат(СтрокаУрока.Дата, "ДФ=dd.MM.yyyy"), Формат(СтрокаУрока.Дата, "ДФ=HH:mm"),
			Строка(СтрокаУрока.Предмет), Строка(СтрокаУрока.Педагог), Строка(СтрокаУрока.Группа),
			?(ЗначениеЗаполнено(СтрокаУрока.Помещение), СтрШаблон(НСтр("ru = 'Помещение: %1.'"), СтрокаУрока.Помещение),
				""),
			Строка(СтрокаУрока.Организация));
		НапомнитьУченику(ЦиклОтправки, Перечисления.УЗ_ВидыСообщений.Занятие, СтрокаУрока.Урок, СтрокаУрока.Ученик,
			СтрокаУрока.Организация,
			Шаблон, Значения, История, Итоги);
	КонецЦикла;
	Возврат Итоги;

КонецФункции

//Напоминания об окончании абонемента: осталось занятий не больше «Осталось занятий» или до конца срока (с
//продлением на приостановки) не больше «Дней до конца срока». Один раз на абонемент каждому получателю.
//Параметры и итог — как у НапоминанияОЗанятиях.
Функция НапоминанияОбАбонементах(Ученики = Неопределено, ЦиклОтправки = Неопределено) Экспорт

	ПроверитьПравоЗапуска();
	Итоги = Новый Массив;
	Шаблон = Шаблон(Перечисления.УЗ_ВидыСообщений.ОкончаниеАбонемента);
	Если Не Шаблон.Включено Или (Шаблон.ОсталосьЗанятий <= 0 И Шаблон.ЗаДней <= 0) Тогда
		Возврат Итоги;
	КонецЕсли;
	ЦиклОтправки = ?(ЦиклОтправки = Неопределено, НовыйЦикл(), ЦиклОтправки);
	Сейчас = ТекущаяДатаСеанса();
	Сегодня = НачалоДня(Сейчас);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Абонементы.Ссылка КАК Абонемент,
	|	Абонементы.ФизЛицо КАК Ученик,
	|	Абонементы.Организация КАК Организация,
	|	Абонементы.ПредметОбучения КАК Предмет
	|ИЗ
	|	Справочник.УЗ_Абонемент КАК Абонементы
	|ГДЕ
	|	НЕ Абонементы.ПометкаУдаления
	|	И Абонементы.Активный
	|	И Абонементы.ДатаНачала <= &Сейчас
	|	И НЕ Абонементы.ФизЛицо.Выбыл
	|	И (&ВсеУченики
	|			ИЛИ Абонементы.ФизЛицо В (&Ученики))";
	Запрос.УстановитьПараметр("Сейчас", Сейчас);
	УстановитьОтборУчеников(Запрос, Ученики);
	Таблица = Запрос.Выполнить().Выгрузить();
	Использовано = Справочники.УЗ_Абонемент.ИспользованоАбонементов(Таблица.ВыгрузитьКолонку("Абонемент"));
	История = ИсторияНапоминаний(Перечисления.УЗ_ВидыСообщений.ОкончаниеАбонемента,
		Таблица.ВыгрузитьКолонку("Абонемент"));
	Для Каждого СтрокаАбонемента Из Таблица Цикл
		Остаток = Справочники.УЗ_Абонемент.ОстатокАбонемента(СтрокаАбонемента.Абонемент,
			Использовано[СтрокаАбонемента.Абонемент]);
		Срок = Справочники.УЗ_Абонемент.СрокСПродлением(СтрокаАбонемента.Абонемент);
		Если ЗначениеЗаполнено(Срок) И Срок < Сегодня Тогда
			Продолжить;		//срок прошёл — напоминать поздно (и старые абонементы при включении не рассылаются)
		КонецЕсли;
		ПоЗанятиям = Остаток.Ограничен И Не Остаток.ПоЧасам И Шаблон.ОсталосьЗанятий > 0
			И Остаток.Осталось <= Шаблон.ОсталосьЗанятий;
		ПоСроку = ЗначениеЗаполнено(Срок) И Шаблон.ЗаДней > 0 И (Срок - Сегодня) / 86400 <= Шаблон.ЗаДней;
		Если Не ПоЗанятиям И Не ПоСроку Тогда
			Продолжить;
		КонецЕсли;
		Значения = Новый Структура("Получатель, Ученик, Абонемент, Предмет, ОсталосьЗанятий, ДействуетДо, Организация",
			"",
			Строка(СтрокаАбонемента.Ученик), Строка(СтрокаАбонемента.Абонемент), Строка(СтрокаАбонемента.Предмет),
			?(Остаток.Ограничен, Остаток.Текст, НСтр("ru = 'без ограничения'")),
			?(ЗначениеЗаполнено(Срок), Формат(Срок, "ДФ=dd.MM.yyyy"), НСтр("ru = 'без срока'")),
			Строка(СтрокаАбонемента.Организация));
		Если Остаток.Ограничен И Не Остаток.ПоЧасам Тогда
			Значения.ОсталосьЗанятий = Формат(Макс(0, Остаток.Осталось), "ЧГ=0; ЧН=0");
		КонецЕсли;
		НапомнитьУченику(ЦиклОтправки, Перечисления.УЗ_ВидыСообщений.ОкончаниеАбонемента, СтрокаАбонемента.Абонемент,
			СтрокаАбонемента.Ученик,
			СтрокаАбонемента.Организация, Шаблон, Значения, История, Итоги);
	КонецЦикла;
	Возврат Итоги;

КонецФункции

#КонецОбласти

#Область Телеграм

//Ссылка привязки Telegram для человека: https://t.me/<бот>?start=<код>. Человек открывает её и нажимает «Запустить»
//— регламентное задание «Привязка Telegram» (ПриемСообщенийТелеграм) запоминает его чат. Код одноразовый, живёт
//СрокКодаДней. Структура: Ссылка, Ошибка.
Функция СсылкаПривязкиТелеграм(ФизЛицо) Экспорт

	Итог = Новый Структура("Ссылка, Ошибка", "", "");
	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Итог.Ошибка = НСтр("ru = 'Сначала запишите карточку.'");
		Возврат Итог;
	КонецЕсли;
	Настройки = НастройкиКанала(Перечисления.УЗ_КаналыСообщений.Телеграм);
	Если ПустаяСтрока(Настройки.ИмяБота) Тогда
		Итог.Ошибка = НСтр("ru = 'Не указано имя бота Telegram: Учёт занятий — Настройки — Каналы сообщений.'");
		Возврат Итог;
	КонецЕсли;
	Код = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
	Запись = РегистрыСведений.УЗ_ПривязкиКаналов.СоздатьМенеджерЗаписи();
	Запись.ФизЛицо = ФизЛицо;
	Запись.Канал = Перечисления.УЗ_КаналыСообщений.Телеграм;
	Запись.Прочитать();
	Запись.ФизЛицо = ФизЛицо;
	Запись.Канал = Перечисления.УЗ_КаналыСообщений.Телеграм;
	Запись.КодПривязки = Код;
	Запись.ДатаКода = ТекущаяДатаСеанса();
	Запись.Записать();
	Итог.Ссылка = СтрШаблон("https://t.me/%1?start=%2", СтрЗаменить(СокрЛП(Настройки.ИмяБота), "@", ""), Код);
	Возврат Итог;

КонецФункции

//Состояние Telegram человека для карточки: «привязан 29.09.2026 (Мама @mama)» или «не привязан».
Функция СостояниеТелеграм(ФизЛицо) Экспорт

	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат НСтр("ru = 'не привязан'");
	КонецЕсли;
	Запись = РегистрыСведений.УЗ_ПривязкиКаналов.СоздатьМенеджерЗаписи();
	Запись.ФизЛицо = ФизЛицо;
	Запись.Канал = Перечисления.УЗ_КаналыСообщений.Телеграм;
	Запись.Прочитать();
	Если Не Запись.Выбран() Или ПустаяСтрока(Запись.Адрес) Тогда
		Возврат ?(Запись.Выбран() И Не ПустаяСтрока(Запись.КодПривязки),
			НСтр("ru = 'не привязан: ссылка выдана, человек ещё не нажал «Запустить»'"), НСтр("ru = 'не привязан'"));
	КонецЕсли;
	Возврат СтрШаблон(НСтр("ru = 'привязан %1%2'"), Формат(Запись.ДатаПривязки, "ДФ=dd.MM.yyyy"),
		?(ПустаяСтрока(Запись.ИмяВМессенджере), "", " (" + Запись.ИмяВМессенджере + ")"));

КонецФункции

//Регламентное задание «Привязка Telegram»: новые сообщения боту. «/start <код>» — привязать чат к человеку, чей это
//код (согласие на сообщения ставится: человек сам нажал «Запустить» по ссылке студии; канал — Telegram, если не
//выбран другой); «/stop» — отписка (согласие снимается, дата отписки). Ответ боту — в тот же чат.
//Основа для бота следующего этапа: разбор команд — в ОбработатьСообщениеТелеграм.
Процедура ПриемСообщенийТелеграм() Экспорт

	ПроверитьПравоЗапуска();
	Канал = Перечисления.УЗ_КаналыСообщений.Телеграм;
	Если Не ПустаяСтрока(ПричинаНеготовностиКанала(Канал)) Тогда
		Возврат;
	КонецЕсли;
	Настройки = НастройкиКанала(Канал);
	Ответ = УЗ_ПровайдерыСообщений.ОбновленияТелеграм(Настройки.СмещениеОбновлений);
	Если Не Ответ.Успех Тогда
		ЗаписьЖурналаРегистрации(УЗ_ПровайдерыСообщений.СобытиеОшибки(), УровеньЖурналаРегистрации.Предупреждение, , ,
			НСтр("ru = 'Telegram: не удалось получить сообщения боту:'") + " " + Ответ.ТекстОшибки);
		Возврат;
	КонецЕсли;
	Смещение = Настройки.СмещениеОбновлений;
	Для Каждого Обновление Из Ответ.Обновления Цикл
		Если ТипЗнч(Обновление.НомерОбновления) = Тип("Число") Тогда
			Смещение = Макс(Смещение, Обновление.НомерОбновления);
		КонецЕсли;
		Если ПустаяСтрока(Обновление.Чат) Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			ОбработатьСообщениеТелеграм(Обновление.Чат, Обновление.Текст, Обновление.Имя);
		Исключение
			ЗаписьЖурналаРегистрации(УЗ_ПровайдерыСообщений.СобытиеОшибки(), УровеньЖурналаРегистрации.Ошибка, , ,
				НСтр("ru = 'Telegram: сообщение боту не обработано:'") + " "
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	Если Смещение <> Настройки.СмещениеОбновлений Тогда
		Запись = РегистрыСведений.УЗ_НастройкиКаналов.СоздатьМенеджерЗаписи();
		Запись.Канал = Канал;
		УстановитьПривилегированныйРежим(Истина);
		Запись.Прочитать();
		Запись.СмещениеОбновлений = Смещение;
		Запись.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

//Команда боту от чата Чат: /start <код> — привязка, /stop — отписка. Возврат: текст ответа (уже отправлен в чат;
//"" — не отвечали).
Функция ОбработатьСообщениеТелеграм(Чат, Текст, Имя = "") Экспорт

	ПроверитьПравоЗапуска();
	Команда = НРег(СокрЛП(Текст));
	Ответ = "";
	Если СтрНачинаетсяС(Команда, "/start") Тогда
		Код = СокрЛП(Сред(СокрЛП(Текст), 7));
		Ответ = ПривязатьЧат(Чат, Код, Имя);
	ИначеЕсли СтрНачинаетсяС(Команда, "/stop") Тогда
		Ответ = ОтписатьЧат(Чат);
	Иначе
		Возврат "";
	КонецЕсли;
	Результат = УЗ_ПровайдерыСообщений.Отправить(Перечисления.УЗ_КаналыСообщений.Телеграм, Чат, Ответ);
	Если Не Результат.Отправлено Тогда
		ЗаписьЖурналаРегистрации(УЗ_ПровайдерыСообщений.СобытиеОшибки(), УровеньЖурналаРегистрации.Предупреждение, , ,
			НСтр("ru = 'Telegram: ответ боту не отправлен:'") + " " + Результат.ТекстОшибки);
	КонецЕсли;
	Возврат Ответ;

КонецФункции

//Сколько дней действует код привязки из ссылки.
Функция СрокКодаДней() Экспорт
	Возврат 30;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Канал и адрес получателя: выбранный в карточке, если готов и есть адрес; иначе почта; нет согласия — не пишем.
Процедура ВыбратьКанал(Получатель, Данные, Готовность)

	Почта = Перечисления.УЗ_КаналыСообщений.Почта;
	Если Данные.Согласие <> Истина Тогда
		Получатель.Причина = НСтр("ru = 'нет согласия на сообщения'");
		Получатель.Представление = Получатель.Имя + ": " + Получатель.Причина;
		Возврат;
	КонецЕсли;
	Выбранный = ?(ЗначениеЗаполнено(Данные.Канал), Данные.Канал, Почта);
	АдресВыбранного = АдресДляКанала(Выбранный, Данные);
	ПричинаВыбранного = "";
	Если ПустаяСтрока(АдресВыбранного) Тогда
		ПричинаВыбранного = ТекстНетАдреса(Выбранный);
	ИначеЕсли Не ПустаяСтрока(Готовность.Получить(Выбранный)) Тогда
		ПричинаВыбранного = Готовность.Получить(Выбранный);
	КонецЕсли;
	Если ПустаяСтрока(ПричинаВыбранного) Тогда
		Получатель.Канал = Выбранный;
		Получатель.Адрес = АдресВыбранного;
		Получатель.МожноПисать = Истина;
	ИначеЕсли Выбранный <> Почта И Не ПустаяСтрока(АдресДляКанала(Почта, Данные))
		И ПустаяСтрока(Готовность.Получить(Почта)) Тогда
		Получатель.Канал = Почта;
		Получатель.Адрес = АдресДляКанала(Почта, Данные);
		Получатель.МожноПисать = Истина;
		Получатель.Причина = СтрШаблон(НСтр("ru = 'почтой вместо «%1»: %2'"), Выбранный, ПричинаВыбранного);
	Иначе
		Получатель.Канал = Выбранный;
		Получатель.Причина = ПричинаВыбранного;
	КонецЕсли;
	Получатель.Представление = СтрШаблон("%1 — %2: %3", Получатель.Имя, Получатель.Канал,
		?(Получатель.МожноПисать, Получатель.Адрес, Получатель.Причина));

КонецПроцедуры

Функция АдресДляКанала(Канал, Данные)

	Если Канал = Перечисления.УЗ_КаналыСообщений.Почта Тогда
		Адрес = СокрЛП(Данные.EMail);
		Возврат ?(СтрНайти(Адрес, "@") > 1, Адрес, "");
	ИначеЕсли Канал = Перечисления.УЗ_КаналыСообщений.Телеграм Тогда
		Возврат СокрЛП(Данные.Чат);
	КонецЕсли;
	Возврат НормализоватьТелефон(Данные.Телефон);

КонецФункции

Функция ТекстНетАдреса(Канал)

	Если Канал = Перечисления.УЗ_КаналыСообщений.Почта Тогда
		Возврат НСтр("ru = 'нет e-mail'");
	ИначеЕсли Канал = Перечисления.УЗ_КаналыСообщений.Телеграм Тогда
		Возврат НСтр("ru = 'Telegram не привязан'");
	КонецЕсли;
	Возврат НСтр("ru = 'нет мобильного телефона'");

КонецФункции

Процедура ДобавитьИтог(Итог, Получатель, Результат)

	Итог.Итоги.Добавить(Новый Структура("Получатель, Канал, Адрес, Отправлено, ТекстОшибки", Получатель.ФизЛицо,
		Получатель.Канал, Получатель.Адрес, Результат.Отправлено, Результат.ТекстОшибки));
	Если Результат.Отправлено Тогда
		Итог.Отправлено = Истина;
		Адреса = ?(ТипЗнч(Получатель.Адрес) = Тип("Массив"), Получатель.Адрес,
			СтрРазделить(Получатель.Адрес, ";", Ложь));
		Для Каждого Адрес Из Адреса Цикл
			Итог.Адреса.Добавить(СокрЛП(Адрес));
		КонецЦикла;
	Иначе
		Итог.ОтправленоВсем = Ложь;
		Если ПустаяСтрока(Итог.ТекстОшибки) Тогда
			Итог.ТекстОшибки = Результат.ТекстОшибки;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция НоваяЗаписьЖурнала(Сообщение, Получатель, Канал, Адрес)

	Запись = РегистрыСведений.УЗ_ЖурналРассылки.НоваяЗапись();
	Запись.Ученик = Сообщение.Ученик;
	Запись.Организация = Сообщение.Организация;
	Запись.Сумма = Сообщение.Сумма;
	Запись.Вид = Сообщение.Вид;
	Запись.Источник = Сообщение.Источник;
	Запись.Вручную = Сообщение.Вручную;
	Запись.Получатель = Получатель;
	Запись.Канал = Канал;
	Запись.Адреса = ?(ТипЗнч(Адрес) = Тип("Массив"), СтрСоединить(Адрес, "; "), Строка(Адрес));
	Возврат Запись;

КонецФункции

//Напоминание по источнику (урок, абонемент) всем получателям ученика, кому оно ещё не ушло.
Процедура НапомнитьУченику(ЦиклОтправки, Вид, Источник, Ученик, Организация, Шаблон, Значения, История, Итоги)

	Для Каждого Получатель Из Получатели(Ученик, ЦиклОтправки.Готовность) Цикл
		Если Не Получатель.МожноПисать Тогда
			Продолжить;
		КонецЕсли;
		Ключ = КлючИстории(Источник, Ученик, Получатель.ФизЛицо);
		Было = История.Получить(Ключ);
		Если Было <> Неопределено И (Было.Отправлено Или Было.Неудач >= МаксимумПопыток()) Тогда
			Продолжить;
		КонецЕсли;
		Значения.Получатель = Получатель.Имя;
		Сообщение = НовоеСообщение(Вид, Ученик, ПодставитьЗначения(Шаблон.Тема, Значения),
			ПодставитьЗначения(Шаблон.Текст, Значения), ПодставитьЗначения(Шаблон.КраткийТекст, Значения));
		Сообщение.Организация = Организация;
		Сообщение.Источник = Источник;
		Результат = ОтправитьПолучателю(ЦиклОтправки, Получатель, Сообщение);
		Если Было = Неопределено Тогда
			Было = Новый Структура("Отправлено, Неудач", Ложь, 0);
			История.Вставить(Ключ, Было);
		КонецЕсли;
		Было.Отправлено = Результат.Отправлено;
		Было.Неудач = Было.Неудач + ?(Результат.Отправлено, 0, 1);
		Итоги.Добавить(Новый Структура("Источник, Ученик, Получатель, Канал, Статус, ТекстОшибки", Источник, Ученик,
			Получатель.ФизЛицо, Получатель.Канал, Результат.Статус, Результат.ТекстОшибки));
	КонецЦикла;

КонецПроцедуры

//История напоминаний вида по источникам: Соответствие КлючИстории → Структура Отправлено, Неудач.
Функция ИсторияНапоминаний(Вид, Источники)

	Итог = Новый Соответствие;
	Если Источники.Количество() = 0 Тогда
		Возврат Итог;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Журнал.Источник КАК Источник,
	|	Журнал.Ученик КАК Ученик,
	|	Журнал.Получатель КАК Получатель,
	|	МАКСИМУМ(Журнал.Отправлено) КАК Отправлено,
	|	СУММА(ВЫБОР
	|			КОГДА Журнал.Отправлено
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК Неудач
	|ИЗ
	|	РегистрСведений.УЗ_ЖурналРассылки КАК Журнал
	|ГДЕ
	|	Журнал.Вид = &Вид
	|	И Журнал.Источник В (&Источники)
	|
	|СГРУППИРОВАТЬ ПО
	|	Журнал.Источник,
	|	Журнал.Ученик,
	|	Журнал.Получатель";
	Запрос.УстановитьПараметр("Вид", Вид);
	Запрос.УстановитьПараметр("Источники", Источники);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Итог.Вставить(КлючИстории(Выборка.Источник, Выборка.Ученик, Выборка.Получатель),
			Новый Структура("Отправлено, Неудач", Выборка.Отправлено = Истина, Выборка.Неудач));
	КонецЦикла;
	Возврат Итог;

КонецФункции

Функция КлючИстории(Источник, Ученик, Получатель)

	Возврат Строка(Источник.УникальныйИдентификатор()) + "|" + Строка(Ученик.УникальныйИдентификатор()) + "|"
		+ ?(ЗначениеЗаполнено(Получатель), Строка(Получатель.УникальныйИдентификатор()), "");

КонецФункции

Процедура УстановитьОтборУчеников(Запрос, Ученики)

	Запрос.УстановитьПараметр("ВсеУченики", Ученики = Неопределено);
	Запрос.УстановитьПараметр("Ученики", ?(Ученики = Неопределено, Новый Массив, Ученики));

КонецПроцедуры

//Напоминания шлёт регламентное задание (фоновый сеанс); вручную — тот, кто меняет настройки каналов (руководитель).
Процедура ПроверитьПравоЗапуска()

	Если ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание() = Неопределено Тогда
		ВыполнитьПроверкуПравДоступа("Изменение", Метаданные.РегистрыСведений.УЗ_НастройкиКаналов);
	КонецЕсли;

КонецПроцедуры

Функция ПодписьОтпискиТелеграм()
	Возврат НСтр("ru = 'Отписаться от сообщений: /stop'");
КонецФункции

//«/start <код>»: код выдан не раньше СрокКодаДней назад — чат привязывается, согласие ставится.
Функция ПривязатьЧат(Чат, Код, Имя)

	Если ПустаяСтрока(Код) Тогда
		Возврат НСтр(
			"ru = 'Здравствуйте! Чтобы получать напоминания о занятиях, откройте ссылку, которую вам дали в студии.'");
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Привязки.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.УЗ_ПривязкиКаналов КАК Привязки
	|ГДЕ
	|	Привязки.Канал = ЗНАЧЕНИЕ(Перечисление.УЗ_КаналыСообщений.Телеграм)
	|	И Привязки.КодПривязки = &Код
	|	И Привязки.ДатаКода >= &Срок";
	Запрос.УстановитьПараметр("Код", Лев(Код, 32));
	Запрос.УстановитьПараметр("Срок", ТекущаяДатаСеанса() - СрокКодаДней() * 86400);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат НСтр("ru = 'Ссылка устарела или уже использована. Попросите в студии новую.'");
	КонецЕсли;
	Запись = РегистрыСведений.УЗ_ПривязкиКаналов.СоздатьМенеджерЗаписи();
	Запись.ФизЛицо = Выборка.ФизЛицо;
	Запись.Канал = Перечисления.УЗ_КаналыСообщений.Телеграм;
	Запись.Прочитать();
	Запись.Адрес = Чат;
	Запись.КодПривязки = "";
	Запись.ДатаПривязки = ТекущаяДатаСеанса();
	Запись.ИмяВМессенджере = Имя;
	Запись.Записать();
	Объект = Выборка.ФизЛицо.ПолучитьОбъект();
	Изменен = Ложь;
	Если Не Объект.ОповеститьПоEmail Тогда
		Объект.ОповеститьПоEmail = Истина;
		Изменен = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ПредпочитаемыйКанал) Тогда
		Объект.ПредпочитаемыйКанал = Перечисления.УЗ_КаналыСообщений.Телеграм;
		Изменен = Истина;
	КонецЕсли;
	Если Изменен Тогда
		Объект.Записать();
	КонецЕсли;
	Возврат СтрШаблон(НСтр("ru = 'Готово: сообщения студии для «%1» будут приходить сюда. Отписаться — /stop'"),
		Выборка.ФизЛицо);

КонецФункции

//«/stop»: согласие снимается у всех, к кому привязан этот чат (у мамы двое детей — это один человек-плательщик).
Функция ОтписатьЧат(Чат)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Привязки.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.УЗ_ПривязкиКаналов КАК Привязки
	|ГДЕ
	|	Привязки.Канал = ЗНАЧЕНИЕ(Перечисление.УЗ_КаналыСообщений.Телеграм)
	|	И Привязки.Адрес = &Чат";
	Запрос.УстановитьПараметр("Чат", Чат);
	Выборка = Запрос.Выполнить().Выбрать();
	Отписано = 0;
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.ФизЛицо.ПолучитьОбъект();
		Если Объект.ОповеститьПоEmail Тогда
			Объект.ОповеститьПоEmail = Ложь;
			Объект.Записать();
		КонецЕсли;
		Отписано = Отписано + 1;
	КонецЦикла;
	Если Отписано = 0 Тогда
		Возврат НСтр("ru = 'Этот чат не подписан на сообщения студии.'");
	КонецЕсли;
	Возврат НСтр(
		"ru = 'Вы отписаны: сообщения студии больше приходить не будут. Подписаться снова — по ссылке из студии.'");

КонецФункции

#КонецОбласти
